tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "turbot/tap"

# shell tools
cask "iterm2"
brew "tmux"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "htop"
brew "zplug"
brew "tree"
cask "font-hack-nerd-font"
brew "ripgrep"
brew "tmuxinator"
brew "gh"
brew "steampipe"
brew "task"

# vim tools
brew "nvim"

# keyboard tools
# cask "karabiner-elements"

# languages
brew "pyenv"
brew "pyenv-virtualenv"
brew "virtualenvwrapper"
brew "zlib" # needed for pyenv installing
brew "go"
brew "yleisradio/terraforms/chtf"
brew "node"

# Install gpg, gnupg, keychain
brew "gpg" 
brew "gnupg" 
brew "keychain"
brew "pinentry-mac"

# CLI tools
brew "googler"
brew "yleisradio/terraforms/chtf"
brew "awscli"
brew "wget"

# Applications
cask 'visual-studio-code'
cask "lastpass"
cask "brave-browser"
cask "itsycal"
# window management
cask "rectangle"
cask "maccy"
cask "kindle"
cask "docker"

# Containers and K8s
cask "docker"
brew "k3d"
# kubernetes cli
brew "k9s"
